In [1]:
import tensorflow as tf

In [2]:
tf.__version__

'2.0.0'

In [2]:
import numpy as np
import pandas as pd

In [3]:
labels = ['a','b','c']
mylist=[10,20,30]
arr=np.array([10,20,30])
d={'a':10,'b':20,'c':30}

In [4]:
pd.Series(data=mylist,index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [6]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [7]:
salesQ1=pd.Series(data=[250,450,200,150],index=['china','usa','japan','india'])

In [8]:
salesQ1

china    250
usa      450
japan    200
india    150
dtype: int64

In [9]:
salesQ1['usa']

450

In [10]:
salesQ2=pd.Series(data=[250,450,200,150],index=['china','usa','japan','brazil'])

In [11]:
salesQ2[0]

250

In [12]:
salesQ1 + salesQ2

brazil      NaN
china     500.0
india       NaN
japan     400.0
usa       900.0
dtype: float64

In [13]:
columns=['W','X','Y','Z']

In [14]:
index=['A','B','C','D','E']

In [15]:
from numpy.random import randint

In [20]:
np.random.seed(42)
data = randint(-100,100,(5,4))

In [21]:
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [22]:
df=pd.DataFrame(data,index,columns)

In [23]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [24]:
df['W']

A     2
B     6
C     2
D    16
E    30
Name: W, dtype: int32

In [25]:
df[['W','Z','Y']]

    W   Z   Y
A   2 -86  -8
B   6 -80  88
C   2 -13 -26
D  16  51   3
E  30 -99 -48

In [34]:
df['new'] = df['W'] + df['Y']

In [35]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [37]:
df=df.drop('new',axis=1)

In [38]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [39]:
df.loc['A']

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int32

In [40]:
df.loc[['A','E']]

    W   X   Y   Z
A   2  79  -8 -86
E  30  49 -48 -99

In [41]:
df.iloc[0]

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int32

In [42]:
df.iloc[0:3]

   W   X   Y   Z
A  2  79  -8 -86
B  6 -29  88 -80
C  2  21 -26 -13

In [43]:
df.drop('C')

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
D  16  -1   3  51
E  30  49 -48 -99

In [44]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [45]:
df.loc['A','W']

2

In [46]:
df.loc[['A','C'],['W','Y']]

   W   Y
A  2  -8
C  2 -26

In [47]:
df > 0

      W      X      Y      Z
A  True   True  False  False
B  True  False   True  False
C  True   True  False  False
D  True  False   True   True
E  True   True  False  False

In [48]:
df[df>0]

    W     X     Y     Z
A   2  79.0   NaN   NaN
B   6   NaN  88.0   NaN
C   2  21.0   NaN   NaN
D  16   NaN   3.0  51.0
E  30  49.0   NaN   NaN

In [49]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [50]:
df['X']>0

A     True
B    False
C     True
D    False
E     True
Name: X, dtype: bool

In [51]:
df[df['X'] > 0]

    W   X   Y   Z
A   2  79  -8 -86
C   2  21 -26 -13
E  30  49 -48 -99

In [53]:
df[(df['W'] > 0) & (df['Y'] > 1)]

    W   X   Y   Z
B   6 -29  88 -80
D  16  -1   3  51

In [54]:
df[(df['W'] > 0) | (df['Y'] > 1)]

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [55]:
df.reset_index()

  index   W   X   Y   Z
0     A   2  79  -8 -86
1     B   6 -29  88 -80
2     C   2  21 -26 -13
3     D  16  -1   3  51
4     E  30  49 -48 -99

In [56]:
new_ind=['CA','NY','WY','OR','CO']

In [57]:
df['States'] = new_ind

In [58]:
df

    W   X   Y   Z States
A   2  79  -8 -86     CA
B   6 -29  88 -80     NY
C   2  21 -26 -13     WY
D  16  -1   3  51     OR
E  30  49 -48 -99     CO

In [59]:
df.set_index('States')

         W   X   Y   Z
States
CA       2  79  -8 -86
NY       6 -29  88 -80
WY       2  21 -26 -13
OR      16  -1   3  51
CO      30  49 -48 -99

In [60]:
df.columns

Index(['W', 'X', 'Y', 'Z', 'States'], dtype='object')

In [61]:
df.describe()

              W          X          Y          Z
count   5.00000   5.000000   5.000000   5.000000
mean   11.20000  23.800000   1.800000 -45.400000
std    11.96662  42.109381  51.915316  63.366395
min     2.00000 -29.000000 -48.000000 -99.000000
25%     2.00000  -1.000000 -26.000000 -86.000000
50%     6.00000  21.000000  -8.000000 -80.000000
75%    16.00000  49.000000   3.000000 -13.000000
max    30.00000  79.000000  88.000000  51.000000

In [62]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      int32
 1   X       5 non-null      int32
 2   Y       5 non-null      int32
 3   Z       5 non-null      int32
 4   States  5 non-null      object
dtypes: int32(4), object(1)
memory usage: 320.0+ bytes

In [26]:
#Pandas Misiing Data

In [28]:
df = pd.DataFrame({'A':[1,2,np.nan,4],'B':[5,np.nan,np.nan,8],'C':[10,20,30,40]})

In [29]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [30]:
df.dropna()

     A    B   C
0  1.0  5.0  10
3  4.0  8.0  40

In [31]:
df.dropna(axis=1)

    C
0  10
1  20
2  30
3  40

In [33]:
df.dropna(axis=1,thresh=2)

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [34]:
df.fillna(value='FILL VALUE')

            A           B   C
0           1           5  10
1           2  FILL VALUE  20
2  FILL VALUE  FILL VALUE  30
3           4           8  40

In [35]:
df.fillna(value=0)

     A    B   C
0  1.0  5.0  10
1  2.0  0.0  20
2  0.0  0.0  30
3  4.0  8.0  40

In [37]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [38]:
df['A'].fillna(value=0)

0    1.0
1    2.0
2    0.0
3    4.0
Name: A, dtype: float64

In [39]:
df['B'].fillna(value=df['B'].mean())

0    5.0
1    6.5
2    6.5
3    8.0
Name: B, dtype: float64

NameError: name 'pd' is not defined